# Review Pandas

In [1]:
import pandas as pd

In [3]:
data = {'nome': ['Cassia', 'Andre', 'Leandro', 'Daniel', 'Luis', 'Marina', 'João', 'Raphael'] ,
'profissao': ['artista', 'comediante', 'mudo', 'fazedor de sites', 'cientista de dados', 'marketeira', 'atleta', 'engenheiro'],
'idade':[19, 30, 22, 28, 32, 5, 34, 37]}

In [4]:
data

{'nome': ['Cassia',
  'Andre',
  'Leandro',
  'Daniel',
  'Luis',
  'Marina',
  'João',
  'Raphael'],
 'profissao': ['artista',
  'comediante',
  'mudo',
  'fazedor de sites',
  'cientista de dados',
  'marketeira',
  'atleta',
  'engenheiro'],
 'idade': [19, 30, 22, 28, 32, 5, 34, 37]}

In [6]:
df = pd.DataFrame(data)

In [7]:
df

      nome           profissao  idade
0   Cassia             artista     19
1    Andre          comediante     30
2  Leandro                mudo     22
3   Daniel    fazedor de sites     28
4     Luis  cientista de dados     32
5   Marina          marketeira      5
6     João              atleta     34
7  Raphael          engenheiro     37

In [8]:
df.head(3)

      nome   profissao  idade
0   Cassia     artista     19
1    Andre  comediante     30
2  Leandro        mudo     22

In [10]:
df['nome']

0     Cassia
1      Andre
2    Leandro
3     Daniel
4       Luis
5     Marina
6       João
7    Raphael
Name: nome, dtype: object

In [11]:
df['idade']

0    19
1    30
2    22
3    28
4    32
5     5
6    34
7    37
Name: idade, dtype: int64

In [12]:
df['idade'].mean()

25.875

In [13]:
df['idade'].min()

5

In [14]:
df['idade'].max()

37

In [15]:
df['idade']

0    19
1    30
2    22
3    28
4    32
5     5
6    34
7    37
Name: idade, dtype: int64

In [16]:
df[df['idade']> 28]

      nome           profissao  idade
1    Andre          comediante     30
4     Luis  cientista de dados     32
6     João              atleta     34
7  Raphael          engenheiro     37

In [23]:
df.query('idade > 28')

      nome           profissao  idade
1    Andre          comediante     30
4     Luis  cientista de dados     32
6     João              atleta     34
7  Raphael          engenheiro     37

In [24]:
# df.query?

In [25]:
df['idade'].where(df['idade'] > 28)

0     NaN
1    30.0
2     NaN
3     NaN
4    32.0
5     NaN
6    34.0
7    37.0
Name: idade, dtype: float64

In [26]:
df_ml = pd.read_csv('dados_mercado_livre.csv')

In [27]:
df_ml

      zona  quartos   area  preco
0      sul      1.0   30.0    700
1      sul      2.0   90.0   1700
2      sul      1.0   30.0    600
3      sul      1.0   40.0    850
4      sul      1.0   20.0    500
..     ...      ...    ...    ...
187  norte      1.0   35.0    700
188  norte      2.0   90.0   2200
189  norte      1.0   45.0   1050
190  norte      3.0  250.0   2100
191  norte      2.0   45.0    950

[192 rows x 4 columns]

In [28]:
df_ml.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 192 entries, 0 to 191
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   zona     192 non-null    object
 1   quartos  167 non-null    float64
 2   area     186 non-null    float64
 3   preco    192 non-null    int64
dtypes: float64(2), int64(1), object(1)
memory usage: 6.1+ KB

In [29]:
df_ml.describe()

          quartos         area         preco
count  167.000000   186.000000  1.920000e+02
mean     2.299401   149.333333  1.236844e+04
std      1.153909   154.382350  1.153659e+05
min      1.000000    20.000000  4.000000e+02
25%      2.000000    60.000000  1.200000e+03
50%      2.000000   100.000000  2.000000e+03
75%      3.000000   177.500000  4.000000e+03
max     10.000000  1300.000000  1.600000e+06

In [30]:
df_ml.describe().T

,count,mean,std,min,25%,50%,75%,max
quartos,167.0,2.299401,1.153909,1.0,2.0,2.0,3.0,10.0
area,186.0,149.333333,154.382350,20.0,60.0,100.0,177.5,1300.0
preco,192.0,12368.437500,115365.875287,400.0,1200.0,2000.0,4000.0,1600000.0

In [32]:
df_ml.notnull().sum()

zona       192
quartos    167
area       186
preco      192
dtype: int64

In [33]:
df_ml.isna().sum()

zona        0
quartos    25
area        6
preco       0
dtype: int64

In [36]:
df_ml.dropna().shape

(167, 4)

In [35]:
df_ml.shape

(192, 4)

In [37]:
192-167

25

In [39]:
df_ml.fillna(0)

      zona  quartos   area  preco
0      sul      1.0   30.0    700
1      sul      2.0   90.0   1700
2      sul      1.0   30.0    600
3      sul      1.0   40.0    850
4      sul      1.0   20.0    500
..     ...      ...    ...    ...
187  norte      1.0   35.0    700
188  norte      2.0   90.0   2200
189  norte      1.0   45.0   1050
190  norte      3.0  250.0   2100
191  norte      2.0   45.0    950

[192 rows x 4 columns]

In [40]:
df_ml['quartos'].fillna(df_ml['quartos'].mean())

0      1.0
1      2.0
2      1.0
3      1.0
4      1.0
      ...
187    1.0
188    2.0
189    1.0
190    3.0
191    2.0
Name: quartos, Length: 192, dtype: float64

In [41]:
df_ml['quartos'].mean()

2.2994011976047903

In [42]:
df_ml_preenchido = df_ml.fillna(df_ml.median())

In [43]:
df_ml_preenchido

      zona  quartos   area  preco
0      sul      1.0   30.0    700
1      sul      2.0   90.0   1700
2      sul      1.0   30.0    600
3      sul      1.0   40.0    850
4      sul      1.0   20.0    500
..     ...      ...    ...    ...
187  norte      1.0   35.0    700
188  norte      2.0   90.0   2200
189  norte      1.0   45.0   1050
190  norte      3.0  250.0   2100
191  norte      2.0   45.0    950

[192 rows x 4 columns]

In [44]:
df_ml.nunique()

zona        2
quartos     6
area       75
preco      77
dtype: int64

In [46]:
df_ml_preenchido

      zona  quartos   area  preco
0      sul      1.0   30.0    700
1      sul      2.0   90.0   1700
2      sul      1.0   30.0    600
3      sul      1.0   40.0    850
4      sul      1.0   20.0    500
..     ...      ...    ...    ...
187  norte      1.0   35.0    700
188  norte      2.0   90.0   2200
189  norte      1.0   45.0   1050
190  norte      3.0  250.0   2100
191  norte      2.0   45.0    950

[192 rows x 4 columns]

In [51]:
def soma_dois(valor):
    return valor + 2

In [52]:
# df_ml.replace?

In [54]:
df_ml_preenchido['quartos']

0      1.0
1      2.0
2      1.0
3      1.0
4      1.0
      ...
187    1.0
188    2.0
189    1.0
190    3.0
191    2.0
Name: quartos, Length: 192, dtype: float64

In [53]:
df_ml_preenchido['quartos'].apply(soma_dois)

0      3.0
1      4.0
2      3.0
3      3.0
4      3.0
      ...
187    3.0
188    4.0
189    3.0
190    5.0
191    4.0
Name: quartos, Length: 192, dtype: float64

In [55]:
df_ml_preenchido['quartos'].apply(lambda x : x + 2)

0      3.0
1      4.0
2      3.0
3      3.0
4      3.0
      ...
187    3.0
188    4.0
189    3.0
190    5.0
191    4.0
Name: quartos, Length: 192, dtype: float64

In [57]:
df_ml_preenchido['quartos'] + 2

0      3.0
1      4.0
2      3.0
3      3.0
4      3.0
      ...
187    3.0
188    4.0
189    3.0
190    5.0
191    4.0
Name: quartos, Length: 192, dtype: float64

In [58]:
df_ml_preenchido['quartos'].map(soma_dois)

0      3.0
1      4.0
2      3.0
3      3.0
4      3.0
      ...
187    3.0
188    4.0
189    3.0
190    5.0
191    4.0
Name: quartos, Length: 192, dtype: float64

In [59]:
df_ml_preenchido['quartos'].map(lambda x : x + 2)

0      3.0
1      4.0
2      3.0
3      3.0
4      3.0
      ...
187    3.0
188    4.0
189    3.0
190    5.0
191    4.0
Name: quartos, Length: 192, dtype: float64

In [60]:
df_ml_preenchido.head()

  zona  quartos  area  preco
0  sul      1.0  30.0    700
1  sul      2.0  90.0   1700
2  sul      1.0  30.0    600
3  sul      1.0  40.0    850
4  sul      1.0  20.0    500

In [61]:
def concatena_ou_soma_20(valor):
    if type(valor) == str:
        return valor + '20*'
    else:
        return valor + 20

In [62]:
df_ml_preenchido.applymap(concatena_ou_soma_20)

         zona  quartos   area  preco
0      sul20*     21.0   50.0    720
1      sul20*     22.0  110.0   1720
2      sul20*     21.0   50.0    620
3      sul20*     21.0   60.0    870
4      sul20*     21.0   40.0    520
..        ...      ...    ...    ...
187  norte20*     21.0   55.0    720
188  norte20*     22.0  110.0   2220
189  norte20*     21.0   65.0   1070
190  norte20*     23.0  270.0   2120
191  norte20*     22.0   65.0    970

[192 rows x 4 columns]